app/Controllers/Astro/MatchController.php

	public function matchhWithAll()
			{
				$userModel = $this->user;

				// Get the total number of rows in the 'users' table
				$totalRows = $userModel->countAll();
---
SELECT COUNT(*) AS "numrows" FROM "users"


				do {
					// Fetch users in chunks
					$usersChunk = $userModel->limit($chunkSize, $offset)->findAll();
---
SELECT *
FROM "users"
 LIMIT 2 OFFSET 2