1yib.rust-bundle
anbuselvanrocky.bootstrap5-vscode
bmewburn.vscode-intelephense-client
docker.docker
dustypomerleau.rust-syntax
ecmel.vscode-html-css
esbenp.prettier-vscode
fill-labs.dependi
github.copilot
github.copilot-chat
github.vscode-github-actions
glenn2223.live-sass
jacqueslucke.blender-development
jeylanib.pine-editor-themes
jeylanib.pinescript
mechatroner.rainbow-csv
ms-azuretools.vscode-containers
ms-azuretools.vscode-docker
ms-python.debugpy
ms-python.python
ms-python.vscode-pylance
ms-python.vscode-python-envs
ms-vscode-remote.remote-containers
ms-vscode.cpptools
ms-vscode.live-server
ms-vscode.makefile-tools
negokaz.live-server-preview
radixpublishing.radix-developer-tools
rust-lang.rust-analyzer
syler.sass-indented
xdebug.php-debug
xdebug.php-pack
zobo.php-intellisense
