app/Controllers/MessagesController.php

SELECT *
FROM "users"
WHERE "users"."userid" = '1004'
---
	public function conversation($otherUserId)
	{
			$currentUserId = $this->getCurrentUserId();
			$otherUser = $this->userModel->find($otherUserId);

SELECT *
FROM "users"
WHERE "users"."userid" = '370'
SELECT *
FROM "users"
WHERE "users"."userid" = '1004'
---
	public function getConversation($otherUserId, $page = 1)
	{
			$currentUserId = $this->getCurrentUserId();
			$limit = 20;
			$offset = ($page - 1) * $limit;

			$messages = $this->messageModel->getConversation($currentUserId, $otherUserId, $limit, $offset);

			// Fetch user details
			$currentUser = $this->userModel->find($currentUserId);
			$otherUser = $this->userModel->find($otherUserId);