app/Controllers/ProfileController.php

public function updateUserF($userId, $field, $value)
		{


			$UserBirth_Table_Select_Condition= $field == 'birthdate'|| $field == 'birthtime_txt' || $field == 'lon' || $field == 'lat' || $field == 'birthtime' || $field == 'timezone'|| $field == 'city'||$field == 'birthcountry'|| $field == 'timezone_txt'|| $field == 'unknowntime';

			$UserProfInfo_Table_Select_Condition= $field == 'profession';

			$UserInterests_Table_Select_Condition= $field =='lookingfor';

			if($UserBirth_Table_Select_Condition)
				{
					$currentData =$this->userBirth->find($userId);
				}

			else if($UserProfInfo_Table_Select_Condition)

				{
					$currentData =$this->userProf->find($userId);
				}

			else if($UserInterests_Table_Select_Condition)

				{
					$currentData =$this->userInterests->find($userId);
				}


			else{$currentData = $this->user->find($userId);}
---
SELECT *
FROM "userinterests"
WHERE "userinterests"."userid" = '370'
SELECT *
FROM "users"
WHERE "users"."userid" = '370'