app/Models/UserMatches.php

UPDATE "usermatches" SET "usera_id" = '370', "userb_id" = '1004', "matchid" = '370_1004', "score_cn" = 12, "score_my" = 0, "score_zd" = 0, "score_hd" = 0, "score_num" = 0, "score_total" = 12
WHERE "matchid" = '370_1004'
---
public function updateInsert($Matchdata, $currentUserMatches)
{
    try {
        $matchID = $Matchdata['matchid'];

        if (!$matchID) {
            throw new \Exception('Matchdata must contain a matchid.');
        }

        // Log incoming data for debugging
        log_message('debug', 'Received Matchdata: ' . json_encode($Matchdata));

        // Check if a record with the given matchID exists
        $existingRecord = $currentUserMatches->where('matchid', $matchID)->get()->getRow();

        if ($existingRecord) {
            // Update existing record
            log_message('debug', "Updating record with matchid: {$matchID}");
            $ql = new QueryLogger();
            $currentUserMatches->where('matchid', $matchID)->set($Matchdata)->update();