app/Models/User.php

SELECT *
FROM "users"
WHERE "username" = 'stefanos'
 LIMIT 1
---
	public function getUserByUsername($username) {
		//$sql = "SELECT * FROM Users WHERE username = ?";
//$user = $this->query($sql, [$username])->getRow();
		$user = $this->where('username', $username)->first();

SELECT *
FROM "users"
WHERE "userid" = '370'
 LIMIT 1
---
	public function getAllUserData($userId)
	{
		// Step 1: Validate the user ID
		if (!$userId) {
			// Handle invalid user ID, for example:
			return null; // or throw an InvalidArgumentException
		}

		// Step 2: Execute the query
		try {
			$userData = $this->where('userid', $userId)->first();

SELECT "new"
FROM "users"
WHERE "userid" = '370'
 LIMIT 1
---
	public function checkIfNew($userId)
{
    $result = $this->select('new')->where('userid', $userId)->first();

SELECT "new"
FROM "users"
WHERE "userid" = '370'
 LIMIT 1
UPDATE "users" SET "new" = 1
WHERE "users"."userid" IN ('370')
---
	public function setAsNew($userId)
	{
		$result = $this->select('new')->where('userid', $userId)->first();

		// Ensure $result is not empty and 'new' value exists
		if (!empty($result) && (int)$result['new'] === 0) {

			$data = [
				'new' => 1,
			];
			$this->update($userId, $data);

SELECT *
FROM "users"
WHERE "userid" = '370'
 LIMIT 1
---
	public function getAllUserProfilePicture($userId)
	{
		$user=$this->where('userid', $userId)->first();