app/Models/UserAstro.php

SELECT *
FROM "userastroinfo"
WHERE "userid" = '370'
UPDATE "userastroinfo" SET "userid" = '370', "sun" = 'Virgo', "moon" = 'Scorpio', "ascendant" = 'Sagittarius'
WHERE "userid" = '370'
---
public function updateAstro($userId,$zd_data){

	$data=[];

	$data['userid']=$userId;
	//var_dump($zd_data);



	$data+=$this->process_zd_data($zd_data);


	$db = \Config\Database::connect();
	$existingData  = $db->table('userastroinfo');

		if ($existingData->where('userid', $userId)->get()->getRow()) {
		// Data exists, perform update
		$existingData->where('userid', $userId)
		->update($data);