app/Models/UserAstro.php

SELECT *
FROM "userastroinfo"
WHERE "userid" = '370'
---
	$db = \Config\Database::connect();
	$existingData  = $db->table('userastroinfo');

		if ($existingData->where('userid', $userId)->get()->getRow()) {