app/Models/UserInterests.php

    public function getAllUserData($userId)
    {
        // Step 1: Validate the user ID
        if (!$userId) {
            // Handle invalid user ID, for example:
            return null; // or throw an InvalidArgumentException
        }

        // Step 2: Execute the query
        try {
            $userData = $this->where('userid', $userId)->first();
---
SELECT *
FROM "userinterests"
WHERE "userid" = '370'
 LIMIT 1